tests/fixtures/cf-edt/src/Documents/Документ1/Документ1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Документ1</name>
  <registerRecords>AccumulationRegister.РегистрНакопления1</registerRecords>
  <attributes>
    <name>Справочник1</name>
    <type>
      <types>CatalogRef.Справочник1</types>
    </type>
  </attributes>
</mdclass:Document>

tests/fixtures/cf-edt/src/AccumulationRegisters/РегистрНакопления1/РегистрНакопления1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РегистрНакопления1</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Измерение1</name>
    <type>
      <types>CatalogRef.Справочник1</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

tests/fixtures/cf-edt/src/Documents/Документ1/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр РегистрНакопления1 Приход
	Движения.РегистрНакопления1.Записывать = Истина;
	Движение = Движения.РегистрНакопления1.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Измерение1 = Справочник1;
	Движение.Количество = 1;
	
КонецПроцедуры
